// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
{
    let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
    console.log((friends.length >= 3) ? 'це великий масив, в якому  3 і більше елементи' : 'це маленький масив, в якому менше 3-х елементів.');
}
// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.
{
    let a = Math.floor(Math.random() * 100);
    let b = Math.floor(Math.random() * 100);
    let c = Math.floor(Math.random() * 100);
    console.log(a, b, c);
    if ((c < a && a < b) || (b < a && a < c)) {
        console.log('перше число знаходиться посередині');
    } else if ((a < b && b < c) || (c < b && b < a)) {
        console.log('друге число знаходиться посередині');
    } else if ((a < c && c < b) || (b < c && c < a)) {
        console.log('третє число знаходиться посередині');
    } else {
        console.log('деякі числа рівні між собою')
    }
}
// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }
{
    let result;
    let a = 1;
    let b = 1;
    result = (a + b < 4) ? 'Мало' : 'Багато';
}
// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором
{
    let num = Math.floor(Math.random() * 200 - 100);
    console.log(num, (num === 0) ? 'число є нулем' : ((num < 0) ? 'число відємне' : 'число додатнє'));
}
